


Network Working Group                                            J. Dong
Internet-Draft                                                   M. Chen
Intended status: Standards Track                     Huawei Technologies
Expires: April 25, 2013                                        G. Mirsky
                                                                Ericsson
                                                        October 22, 2012


  LDP Extensions for Lock Instruct and Loopback of Pseudowire in MPLS
                           Transport Profile
                    draft-dong-pwe3-mpls-tp-li-lb-01

Abstract

   This document specifies extensions to the Label Distribution Protocol
   (LDP) to support provisioning of lock instruct and loopback mechanism
   for MPLS-TP Pseudowires.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 25, 2013.

Copyright Notice

   Copyright (c) 2012 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Dong, et al.             Expires April 25, 2013                 [Page 1]

Internet-Draft         LDP Extensions for PW LI&LB          October 2012


   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 3
   2.  LDP Extensions  . . . . . . . . . . . . . . . . . . . . . . . . 3
     2.1.  Extensions to MPLS-TP PW OAM Administration TLV . . . . . . 3
     2.2.  Extensions to PW Status TLV . . . . . . . . . . . . . . . . 4
   3.  Operations  . . . . . . . . . . . . . . . . . . . . . . . . . . 4
     3.1.  Lock Instruct . . . . . . . . . . . . . . . . . . . . . . . 4
     3.2.  Loopback  . . . . . . . . . . . . . . . . . . . . . . . . . 5
   4.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 6
   5.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6
   6.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 6
     6.1.  Normative References  . . . . . . . . . . . . . . . . . . . 6
     6.2.  Informative References  . . . . . . . . . . . . . . . . . . 7
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . . . 7



























Dong, et al.             Expires April 25, 2013                 [Page 2]

Internet-Draft         LDP Extensions for PW LI&LB          October 2012


1.  Introduction

   The requirements for Lock Instruct (LI) and Loopback (LB) are
   specified in [RFC5860], and the framework of LI and LB is specified
   in [RFC6371].  [RFC6435] defines management plane based Lock Instruct
   (LI) and Loopback (LB) mechanisms, and an LI OAM message can be used
   for additional lock coordination between the MEPs.  Management plane
   based LI and LB is suitable for scenarios where dynamic control plane
   is not available.

   When a dynamic control plane is used for establishing MPLS-TP
   pseudowires (PWs), it's natural to use and extend the control plane
   protocol to provision LI and LB functions.  Unlike other OAM
   mechanisms, LI and LB would modify the forwarding plane of a PW, thus
   without the involvement of control plane this may result in
   inconsistency between control plane and data plane.  Besides, with
   control plane based mechanism, it does not need to rely on the TTL
   expiration to make the OAM requests reach particular MIP or MEP.

   This document specifies extensions to LDP to implement LI and LB for
   MPLS-TP PWs when MPLS-TP control plane is used.  The mechanisms
   defined in this document are complementary to [RFC6435].


2.  LDP Extensions

2.1.  Extensions to MPLS-TP PW OAM Administration TLV

   Two new flags (Lock bit and Loopback bit) are defined in MPLS-TP PW
   OAM Administration TLV [I-D.ietf-pwe3-oam-config].

   Format of extended MPLS-TP PW OAM Administration TLV is as below:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |0|0|          Type (TBD)     |            Length               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |I|A|K|B|                  Reserved                             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Lock (K): When this bit is set, it indicates that the T-PE needs to
   enable "Lock" function for this PW.

   Loopback (B): When this bit is set, it indicates that the target node
   of this message SHOULD enable loopback function for this PW.





Dong, et al.             Expires April 25, 2013                 [Page 3]

Internet-Draft         LDP Extensions for PW LI&LB          October 2012


2.2.  Extensions to PW Status TLV

   Two new Status bits are defined in PW Status TLV:
   Bit Mask     Description
   ====================================================================
   0x00000020   Pseudowire in Lock Mode                 [this document]
   0x00000040   Pseudowire in Loopback Mode             [this document]


3.  Operations

   The control plane based Lock Instruct and Loopback functions are
   applicable to both Single-Segment Pseudowire (SS-PW) [RFC3985]
   [RFC4447] and Multi-Segment Pseudowire (MS-PW) [RFC5659] [RFC6073].

3.1.  Lock Instruct

   When a PE/T-PE wants to put a PW into lock mode, it MUST send a
   Mapping message with the Lock (K) bit in the MPLS-TP PW OAM
   Administration TLV set.

   For SS-PW, when the Mapping message arrives at the remote PE, the
   receiving PE SHOULD try to take the PW out of service.  If the
   receiving PE locks the PW successfully, it SHOULD send a Notification
   message with PW status "Pseudowire in Lock Mode".  Otherwise, it
   SHOULD send a Notification message with the LDP Status code set to
   "PW Lock Failure".

   For MS-PW, when the Mapping message arrives at a downstream S-PE, the
   receiving S-PE SHOULD forward this Mapping message unchanged towards
   the remote T-PE.  When the Mapping message arrives at the remote
   T-PE, it SHOULD try to take the PW out of service.  If the receiving
   T-PE locks the PW successfully, it SHOULD send a Notification message
   with PW status "Pseudowire in Lock Mode" to the upstream S-PE.
   Otherwise, it SHOULD send a Notification message with the LDP Status
   code set to "PW Lock Failure".  On receipt of the Notification
   message, the S-PEs would know whether the MS-PW is in lock mode or
   not, and the S-PEs SHOULD forward the Notification message back to
   the Source T-PE.

   When the PE/T-PE wants to take the PW out of the lock mode, it MUST
   send a Mapping message with the Lock (K) bit in the MPLS-TP PW OAM
   Administration TLV cleared.  The receiving PE/T-PE SHOULD try to
   unlock the PW.  If the PW is unlocked successfully, the receiving PE/
   T-PE SHOULD send a Notification message with PW status bit
   "Pseudowire in Lock Mode" cleared.  Otherwise, it SHOULD send a
   Notification message with the LDP Status code set to "PW Unlock
   Failure".



Dong, et al.             Expires April 25, 2013                 [Page 4]

Internet-Draft         LDP Extensions for PW LI&LB          October 2012


3.2.  Loopback

   When a PE/T-PE wants to put the remote PE/T-PE of a PW into loopback
   mode, it MUST send a Mapping message with both the Lock (K) bit and
   Loopback (B) bit in the MPLS-TP PW OAM Administration TLV set.  When
   a T-PE wants to put a particular S-PE of the PW into loopback mode,
   it MUST send a Mapping message with both the Lock (K) bit and
   Loopback (B) bit set, and an Explicit Route Hop TLV(ER-Hop TLV)
   [I-D.ietf-pwe3-mspw-er] identifying the Target S-PE node MUST be
   carried in the Mapping message.  The L flag in the ER-Hop TLV SHOULD
   be cleared.  To ensure that the ER-Hop TLV identifies a single node
   as the Target S-PE, The PreLen field in the IPv4 prefix ER-Hop TLV
   SHOULD be set to 32, the PreLen field in the IPv6 prefix ER-Hop TLV
   SHOULD be set to 128, and the PreLen field in the L2 PW Address ER-
   Hop TLV SHOULD be set to 96.  Information of the S-PE node can be
   collected using the SP-PE TLVs [RFC6073].

   When the Mapping message arrives at the remote PE/T-PE, the receiving
   PE SHOULD try to put the PW in loopback mode.  If the receiver node
   puts the PW into loopback mode successfully, it SHOULD send a
   Notification message with PW status "Pseudowire in Loopback Mode".
   Otherwise, it SHOULD send a Notification message with the LDP Status
   code set to "PW Enter Loopback Failure".

   When a Mapping message with an ER-Hop TLV arrives an S-PE, the S-PE
   SHOULD check the ER-Hop TLV to see if it is the target S-PE of the
   message.  If not, the S-PE SHOULD forward the message unchanged to
   the next hop S-PE.  When the Mapping message arrives at the target
   S-PE, the S-PE SHOULD parse the MPLS-TP PW OAM Administration TLV and
   try to put the PW into loopback mode.  If the S-PE puts the PW into
   loopback mode successfully, it SHOULD send a Notification message
   with PW status set to "Pseudowire in Loopback Mode".  An SP-PE TLV
   identifying the S-PE in loopback mode SHOULD also be carried in the
   Notification message.  If the S-PE fails to put the PW into loopback
   mode, it SHOULD send a Notification message with the LDP Status code
   set to "PW Enter Loopback Failure".  An SP-PE TLV identifying this
   S-PE SHOULD also be carried in the Notification message.

   When the PE/T-PE wants to take the remote PE/T-PE out of the loopback
   mode, it MUST send a Mapping message with the Lock (K) bit set and
   Loopback (B) bit cleared.  When the T-PE wants to take a particular
   S-PE out of loopback mode, the message MUST also carry an ER-Hop TLV
   to identify the target S-PE.  If the PW is taken out of loopback mode
   successfully, the receiving PE/T-PE/S-PE SHOULD send a Notification
   message with PW status bit "Pseudowire in Loopback Mode" cleared.
   Otherwise, it SHOULD send a Notification message with the LDP Status
   code set to "PW Exit Loopback Failure".  For the S-PE case, An SP-PE
   TLV identifying this S-PE node SHOULD also be carried in the



Dong, et al.             Expires April 25, 2013                 [Page 5]

Internet-Draft         LDP Extensions for PW LI&LB          October 2012


   Notification message.


4.  IANA Considerations

   Two bits ("Lock" (K) and "Loopback" (B)) as defined in section 2.1
   need to be allocated in the MPLS-TP PW OAM Administration TLV.

   Two new PW Status bits as defined in section 2.2 need to be allocated
   in the "Pseudowire Status Codes" Registry.

   Four new LDP status codes need to be assigned by the IANA in the LDP
   "STATUS CODE NAME SPACE":

   Range/Value   E    Description
   TBA           0    PW Lock Failure
   TBA           0    PW Unlock Failure
   TBA           0    PW Enter Loopback Failure
   TBA           0    PW Exit Loopback Failure


5.  Security Considerations

   TBD


6.  References

6.1.  Normative References

   [I-D.ietf-pwe3-mspw-er]
              Dutta, P., Bocci, M., and L. Martini, "Explicit Path
              Routing for Dynamic Multi-Segment Pseudowires",
              draft-ietf-pwe3-mspw-er-01 (work in progress), June 2012.

   [I-D.ietf-pwe3-oam-config]
              Zhang, F., Bo, W., and E. Bellagamba, "Label Distribution
              Protocol Extensions for Proactive Operations,
              Administration and Maintenance Configuration of Dynamic
              MPLS Transport Profile PseudoWire",
              draft-ietf-pwe3-oam-config-01 (work in progress),
              August 2012.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC3985]  Bryant, S. and P. Pate, "Pseudo Wire Emulation Edge-to-
              Edge (PWE3) Architecture", RFC 3985, March 2005.



Dong, et al.             Expires April 25, 2013                 [Page 6]

Internet-Draft         LDP Extensions for PW LI&LB          October 2012


   [RFC4447]  Martini, L., Rosen, E., El-Aawar, N., Smith, T., and G.
              Heron, "Pseudowire Setup and Maintenance Using the Label
              Distribution Protocol (LDP)", RFC 4447, April 2006.

   [RFC5659]  Bocci, M. and S. Bryant, "An Architecture for Multi-
              Segment Pseudowire Emulation Edge-to-Edge", RFC 5659,
              October 2009.

   [RFC5860]  Vigoureux, M., Ward, D., and M. Betts, "Requirements for
              Operations, Administration, and Maintenance (OAM) in MPLS
              Transport Networks", RFC 5860, May 2010.

   [RFC6073]  Martini, L., Metz, C., Nadeau, T., Bocci, M., and M.
              Aissaoui, "Segmented Pseudowire", RFC 6073, January 2011.

   [RFC6371]  Busi, I. and D. Allan, "Operations, Administration, and
              Maintenance Framework for MPLS-Based Transport Networks",
              RFC 6371, September 2011.

6.2.  Informative References

   [RFC6435]  Boutros, S., Sivabalan, S., Aggarwal, R., Vigoureux, M.,
              and X. Dai, "MPLS Transport Profile Lock Instruct and
              Loopback Functions", RFC 6435, November 2011.


Authors' Addresses

   Jie Dong
   Huawei Technologies
   Huawei Building, No.156 Beiqing Rd.
   Beijing  100095
   China

   Email: jie.dong@huawei.com


   Mach Chen
   Huawei Technologies
   Huawei Building, No.156 Beiqing Rd.
   Beijing  100095
   China

   Email: mach.chen@huawei.com







Dong, et al.             Expires April 25, 2013                 [Page 7]

Internet-Draft         LDP Extensions for PW LI&LB          October 2012


   Greg Mirsky
   Ericsson

   Email: gregory.mirsky@ericsson.com















































Dong, et al.             Expires April 25, 2013                 [Page 8]

